Date and time: 2018-10-08 13:14:54

Datasets used: ['/home/kenny/Desktop/copterutils/seg/data/images/ds1', '/home/kenny/Desktop/copterutils/seg/data/images/ds1/albumentated']

Number of images: 143
Number of masks: 143

Y min: 0
Y max: 8

X shape: (20, 1024, 1280, 3)
Y shape: (20, 1024, 1280)

Cropping squared images...
X shape: (20, 1024, 1024, 3)
Y shape: (20, 1024, 1024)

Cropping 512x512 batches...
X shape: (80, 512, 512, 3)
Y shape: (80, 512, 512)

Classes: ['background', 'asphalt', 'building', 'forest', 'grass', 'ground', 'roadAsphalt', 'roadGround', 'water']

Class distribution: [ 3.93526077 16.13148689 10.73868752  3.73259544 38.24572086  5.05961895
 20.50240993  0.93113899  0.72308064] %

Class weights for balancing dataset: [1.28571377 0.31364864 0.47115804 1.35552299 0.13229242 1.
 0.24678167 5.43379559 6.99730943]

One hot encoding Y matrix to categorical...
Y shape: (80, 512, 512, 9)

X dtype after conversion: float64
Y dtype after conversion: int64

Train/test split: 0.8/0.2

X_train shape: (64, 512, 512, 3)
Y_train shape: (64, 512, 512, 9)

X_test shape: (16, 512, 512, 3)
Y_test shape: (16, 512, 512, 9)

Keras image data format: channels_last

Epochs: 1, batch size: 1

Keras augmentation used: {'width_shift_range': 0.25, 'height_shift_range': 0.25}

Model summary:
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 512, 512, 3)  0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 512, 512, 64) 1792        input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 512, 512, 64) 36928       conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 256, 256, 64) 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 256, 256, 128 73856       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 256, 256, 128 147584      conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 128, 128, 128 0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 128, 128, 256 295168      max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 128, 128, 256 590080      conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 64, 64, 256)  0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 64, 64, 512)  1180160     max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 64, 64, 512)  2359808     conv2d_7[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 64, 64, 512)  0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 32, 32, 512)  0           dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 32, 1024) 4719616     max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 32, 1024) 9438208     conv2d_9[0][0]                   
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 32, 32, 1024) 0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 64, 64, 1024) 0           dropout_2[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 64, 64, 512)  2097664     up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 64, 64, 1024) 0           dropout_1[0][0]                  
                                                                 conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 64, 64, 512)  4719104     concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 64, 64, 512)  2359808     conv2d_12[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 128, 128, 512 0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 128, 128, 256 524544      up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 128, 128, 512 0           conv2d_6[0][0]                   
                                                                 conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 128, 128, 256 1179904     concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 128, 128, 256 590080      conv2d_15[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 256, 256, 256 0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 256, 256, 128 131200      up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 256, 256, 256 0           conv2d_4[0][0]                   
                                                                 conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 256, 256, 128 295040      concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 256, 256, 128 147584      conv2d_18[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_4 (UpSampling2D)  (None, 512, 512, 128 0           conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 512, 512, 64) 32832       up_sampling2d_4[0][0]            
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 512, 512, 128 0           conv2d_2[0][0]                   
                                                                 conv2d_20[0][0]                  
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 512, 512, 64) 73792       concatenate_4[0][0]              
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 512, 512, 64) 36928       conv2d_21[0][0]                  
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 512, 512, 9)  585         conv2d_22[0][0]                  
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 512, 512, 9)  0           conv2d_23[0][0]                  
==================================================================================================
Total params: 31,032,265
Trainable params: 31,032,265
Non-trainable params: 0
__________________________________________________________________________________________________
Optimizer: <keras.optimizers.Adam object at 0x7f3fa381a128>, learning rate: 0.0001, loss: categorical_crossentropy, metrics: ['accuracy']

Callbacks: [<keras.callbacks.ModelCheckpoint object at 0x7f3fa37f0f98>, <keras.callbacks.TensorBoard object at 0x7f3fa37f0fd0>, <keras.callbacks.ReduceLROnPlateau object at 0x7f3fa381f080>, <keras.callbacks.CSVLogger object at 0x7f3fa381f0b8>]

Steps per epoch: 128
Validation steps: 16

Starting training...

Epoch 1/1
  1/128 [..............................] - ETA: 30:39 - loss: 2.3042 - acc: 0.0077  2/128 [..............................] - ETA: 28:48 - loss: 2.2139 - acc: 0.0220  3/128 [..............................] - ETA: 29:20 - loss: 2.3677 - acc: 0.0231  4/128 [..............................] - ETA: 29:28 - loss: 2.2863 - acc: 0.1081  5/128 [>.............................] - ETA: 28:27 - loss: 2.1886 - acc: 0.1667  6/128 [>.............................] - ETA: 27:50 - loss: 2.0841 - acc: 0.2522  7/128 [>.............................] - ETA: 27:57 - loss: 2.0535 - acc: 0.2936  8/128 [>.............................] - ETA: 27:58 - loss: 2.0516 - acc: 0.2577  9/128 [=>............................] - ETA: 27:55 - loss: 1.9595 - acc: 0.3214 10/128 [=>............................] - ETA: 27:51 - loss: 1.9328 - acc: 0.3613 11/128 [=>............................] - ETA: 27:45 - loss: 2.0582 - acc: 0.3286 12/128 [=>............................] - ETA: 27:38 - loss: 2.0409 - acc: 0.3434 13/128 [==>...........................] - ETA: 27:28 - loss: 2.0584 - acc: 0.3426 14/128 [==>...........................] - ETA: 27:19 - loss: 2.0426 - acc: 0.3377 15/128 [==>...........................] - ETA: 27:10 - loss: 2.0313 - acc: 0.3599 16/128 [==>...........................] - ETA: 27:06 - loss: 2.0548 - acc: 0.3505 17/128 [==>...........................] - ETA: 26:54 - loss: 2.0635 - acc: 0.3412 18/128 [===>..........................] - ETA: 26:41 - loss: 2.0653 - acc: 0.3404 19/128 [===>..........................] - ETA: 26:28 - loss: 2.0703 - acc: 0.3235 20/128 [===>..........................] - ETA: 26:15 - loss: 2.0462 - acc: 0.3572 21/128 [===>..........................] - ETA: 25:53 - loss: 2.0544 - acc: 0.3493 22/128 [====>.........................] - ETA: 25:28 - loss: 2.0308 - acc: 0.3743 23/128 [====>.........................] - ETA: 25:13 - loss: 2.0046 - acc: 0.4015 24/128 [====>.........................] - ETA: 25:01 - loss: 2.0232 - acc: 0.3915 25/128 [====>.........................] - ETA: 24:47 - loss: 2.0281 - acc: 0.3795 26/128 [=====>........................] - ETA: 24:34 - loss: 2.0062 - acc: 0.3947 27/128 [=====>........................] - ETA: 24:21 - loss: 2.0043 - acc: 0.3874 28/128 [=====>........................] - ETA: 24:07 - loss: 2.0114 - acc: 0.3874 29/128 [=====>........................] - ETA: 23:53 - loss: 2.0074 - acc: 0.3835 30/128 [======>.......................] - ETA: 23:40 - loss: 2.0001 - acc: 0.3770 31/128 [======>.......................] - ETA: 23:26 - loss: 1.9811 - acc: 0.3929 32/128 [======>.......................] - ETA: 23:05 - loss: 1.9673 - acc: 0.3915 33/128 [======>.......................] - ETA: 22:46 - loss: 1.9396 - acc: 0.4076 34/128 [======>.......................] - ETA: 22:32 - loss: 1.9404 - acc: 0.4108 35/128 [=======>......................] - ETA: 22:19 - loss: 1.9789 - acc: 0.4043 36/128 [=======>......................] - ETA: 22:05 - loss: 1.9836 - acc: 0.4046 37/128 [=======>......................] - ETA: 21:52 - loss: 2.0024 - acc: 0.4004